{
  "architectures": [
    "GlmMoeDsaForCausalLM"
  ],
  "attention_bias": false,
  "attention_dropout": 0.0,
  "dtype": "bfloat16",
  "eos_token_id": [
    154820,
    154827,
    154829
  ],
  "ep_size": 1,
  "first_k_dense_replace": 3,
  "head_dim": 192,
  "hidden_act": "silu",
  "hidden_size": 6144,
  "index_head_dim": 128,
  "index_n_heads": 32,
  "index_share_for_mtp_iteration": true,
  "index_skip_topk_offset": 3,
  "index_topk": 2048,
  "index_topk_freq": 4,
  "index_topk_pattern": null,
  "indexer_rope_interleave": true,
  "indexer_types": [
    "full",
    "full",
    "full",
    "shared",
    "shared",
    "shared",
    "full",
    "shared",
    "shared",
    "shared",
    "full",
    "shared",
    "shared",
    "shared",
    "full",
    "shared",
    "shared",
    "shared",
    "full",
    "shared",
    "shared",
    "shared",
    "full",
    "shared",
    "shared",
    "shared",
    "full",
    "shared",
    "shared",
    "shared",
    "full",
    "shared",
    "shared",
    "shared",
    "full",
    "shared",
    "shared",
    "shared",
    "full",
    "shared",
    "shared",
    "shared",
    "full",
    "shared",
    "shared",
    "shared",
    "full",
    "shared",
    "shared",
    "shared",
    "full",
    "shared",
    "shared",
    "shared",
    "full",
    "shared",
    "shared",
    "shared",
    "full",
    "shared",
    "shared",
    "shared",
    "full",
    "shared",
    "shared",
    "shared",
    "full",
    "shared",
    "shared",
    "shared",
    "full",
    "shared",
    "shared",
    "shared",
    "full",
    "shared",
    "shared",
    "shared"
  ],
  "initializer_range": 0.02,
  "intermediate_size": 12288,
  "kv_lora_rank": 512,
  "max_position_embeddings": 1048576,
  "mlp_layer_types": [
    "dense",
    "dense",
    "dense",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse",
    "sparse"
  ],
  "model_type": "glm_moe_dsa",
  "moe_intermediate_size": 2048,
  "moe_layer_freq": 1,
  "moe_router_dtype": "float32",
  "n_group": 1,
  "n_routed_experts": 256,
  "n_shared_experts": 1,
  "norm_topk_prob": true,
  "num_attention_heads": 64,
  "num_experts_per_tok": 8,
  "num_hidden_layers": 78,
  "num_key_value_heads": 64,
  "num_nextn_predict_layers": 1,
  "pad_token_id": 154820,
  "pretraining_tp": 1,
  "q_lora_rank": 2048,
  "qk_head_dim": 256,
  "qk_nope_head_dim": 192,
  "qk_rope_head_dim": 64,
  "rms_norm_eps": 1e-05,
  "rope_interleave": true,
  "rope_parameters": {
    "rope_theta": 8000000,
    "rope_type": "default"
  },
  "routed_scaling_factor": 2.5,
  "scoring_func": "sigmoid",
  "tie_word_embeddings": false,
  "topk_group": 1,
  "topk_method": "noaux_tc",
  "transformers_version": "5.12.0",
  "use_cache": true,
  "v_head_dim": 256,
  "vocab_size": 154880,
  "quantization_config": {
    "activation_scheme": "dynamic",
    "fmt": "e4m3",
    "quant_method": "fp8",
    "weight_block_size": [
      128,
      128
    ],
    "modules_to_not_convert": [
      "model.layers.59.post_attention_layernorm",
      "model.layers.47.mlp.gate.e_score_correction_bias",
      "model.layers.71.self_attn.kv_a_layernorm",
      "model.layers.46.mlp.gate.e_score_correction_bias",
      "model.layers.30.self_attn.kv_a_layernorm",
      "model.layers.23.self_attn.kv_a_layernorm",
      "model.layers.73.mlp.gate.e_score_correction_bias",
      "model.layers.36.mlp.gate",
      "model.layers.12.self_attn.q_a_layernorm",
      "model.layers.51.mlp.gate",
      "model.layers.47.self_attn.kv_a_layernorm",
      "model.layers.45.self_attn.q_a_layernorm",
      "model.layers.15.self_attn.q_a_layernorm",
      "model.layers.39.input_layernorm",
      "model.layers.50.self_attn.kv_a_layernorm",
      "model.layers.19.post_attention_layernorm",
      "model.layers.71.input_layernorm",
      "model.layers.72.self_attn.kv_a_layernorm",
      "model.layers.70.mlp.gate",
      "model.layers.52.input_layernorm",
      "model.layers.78.self_attn.kv_a_layernorm",
      "model.layers.48.post_attention_layernorm",
      "model.layers.4.self_attn.q_a_layernorm",
      "model.layers.62.self_attn.q_a_layernorm",
      "model.layers.4.post_attention_layernorm",
      "model.layers.38.self_attn.indexers_proj",
      "model.layers.61.mlp.gate.e_score_correction_bias",
      "model.layers.14.mlp.gate.e_score_correction_bias",
      "model.layers.36.self_attn.kv_a_layernorm",
      "model.layers.65.mlp.gate",
      "model.layers.13.self_attn.kv_a_layernorm",
      "model.layers.57.mlp.gate",
      "model.layers.65.self_attn.kv_a_layernorm",
      "model.layers.68.input_layernorm",
      "model.layers.70.self_attn.kv_a_layernorm",
      "model.layers.24.mlp.gate.e_score_correction_bias",
      "model.layers.4.input_layernorm",
      "model.layers.20.input_layernorm",
      "model.layers.65.self_attn.q_a_layernorm",
      "model.layers.38.mlp.gate",
      "model.layers.76.mlp.gate.e_score_correction_bias",
      "model.layers.62.input_layernorm",
      "model.layers.45.input_layernorm",
      "model.layers.68.post_attention_layernorm",
      "model.layers.72.input_layernorm",
      "model.layers.32.mlp.gate.e_score_correction_bias",
      "model.layers.27.input_layernorm",
      "model.layers.16.post_attention_layernorm",
      "model.layers.35.self_attn.q_a_layernorm",
      "model.layers.58.self_attn.indexers_proj",
      "model.layers.3.mlp.gate.e_score_correction_bias",
      "model.layers.49.self_attn.q_a_layernorm",
      "model.layers.66.mlp.gate.e_score_correction_bias",
      "model.layers.10.self_attn.q_a_layernorm",
      "model.layers.51.mlp.gate.e_score_correction_bias",
      "model.layers.64.self_attn.q_a_layernorm",
      "model.layers.70.input_layernorm",
      "model.layers.71.post_attention_layernorm",
      "model.layers.67.post_attention_layernorm",
      "model.layers.6.self_attn.indexer.k_norm",
      "model.layers.3.mlp.gate",
      "model.layers.11.mlp.gate",
      "model.layers.17.input_layernorm",
      "model.layers.13.mlp.gate",
      "model.layers.15.mlp.gate",
      "model.layers.71.self_attn.q_a_layernorm",
      "model.layers.33.mlp.gate.e_score_correction_bias",
      "model.layers.72.mlp.gate.e_score_correction_bias",
      "model.layers.65.post_attention_layernorm",
      "model.layers.78.hnorm",
      "model.layers.40.post_attention_layernorm",
      "model.layers.12.mlp.gate.e_score_correction_bias",
      "model.layers.8.input_layernorm",
      "model.layers.73.mlp.gate",
      "model.layers.11.post_attention_layernorm",
      "model.layers.61.input_layernorm",
      "model.layers.14.self_attn.kv_a_layernorm",
      "model.layers.39.self_attn.kv_a_layernorm",
      "model.layers.70.self_attn.indexer.k_norm",
      "model.layers.45.mlp.gate",
      "model.layers.51.self_attn.q_a_layernorm",
      "model.layers.64.post_attention_layernorm",
      "model.layers.20.post_attention_layernorm",
      "model.layers.66.self_attn.kv_a_layernorm",
      "model.layers.10.self_attn.indexer.k_norm.bias",
      "model.layers.23.input_layernorm",
      "model.layers.38.self_attn.indexer.k_norm",
      "model.layers.19.self_attn.kv_a_layernorm",
      "model.layers.40.self_attn.q_a_layernorm",
      "model.layers.10.self_attn.indexer.k_norm",
      "model.layers.44.post_attention_layernorm",
      "model.layers.70.post_attention_layernorm",
      "model.layers.41.mlp.gate.e_score_correction_bias",
      "model.layers.36.post_attention_layernorm",
      "model.layers.30.self_attn.indexer.k_norm.bias",
      "model.layers.54.self_attn.q_a_layernorm",
      "model.layers.59.mlp.gate",
      "model.layers.69.post_attention_layernorm",
      "lm_head",
      "model.layers.77.self_attn.kv_a_layernorm",
      "model.layers.75.self_attn.q_a_layernorm",
      "model.layers.56.self_attn.q_a_layernorm",
      "model.layers.50.self_attn.indexer.k_norm.bias",
      "model.layers.54.mlp.gate",
      "model.layers.6.self_attn.indexer.k_norm.bias",
      "model.layers.15.input_layernorm",
      "model.layers.29.self_attn.q_a_layernorm",
      "model.layers.54.self_attn.indexers_proj",
      "model.layers.73.self_attn.kv_a_layernorm",
      "model.layers.0.self_attn.indexer.k_norm",
      "model.layers.58.self_attn.indexer.k_norm",
      "model.layers.36.input_layernorm",
      "model.layers.47.self_attn.q_a_layernorm",
      "model.layers.26.mlp.gate.e_score_correction_bias",
      "model.layers.50.input_layernorm",
      "model.layers.16.self_attn.q_a_layernorm",
      "model.layers.19.mlp.gate.e_score_correction_bias",
      "model.layers.78.input_layernorm",
      "model.layers.27.mlp.gate",
      "model.layers.19.self_attn.q_a_layernorm",
      "model.layers.25.input_layernorm",
      "model.layers.33.self_attn.kv_a_layernorm",
      "model.layers.32.mlp.gate",
      "model.layers.61.self_attn.kv_a_layernorm",
      "model.layers.50.self_attn.indexers_proj",
      "model.layers.34.self_attn.indexers_proj",
      "model.layers.4.mlp.gate.e_score_correction_bias",
      "model.layers.76.post_attention_layernorm",
      "model.layers.57.post_attention_layernorm",
      "model.layers.73.post_attention_layernorm",
      "model.layers.68.mlp.gate.e_score_correction_bias",
      "model.layers.34.self_attn.kv_a_layernorm",
      "model.layers.78.enorm",
      "model.layers.30.mlp.gate",
      "model.layers.10.self_attn.indexers_proj",
      "model.layers.34.input_layernorm",
      "model.layers.34.post_attention_layernorm",
      "model.layers.20.mlp.gate.e_score_correction_bias",
      "model.layers.54.self_attn.indexer.k_norm.bias",
      "model.layers.44.mlp.gate",
      "model.layers.25.mlp.gate.e_score_correction_bias",
      "model.layers.26.self_attn.indexers_proj",
      "model.layers.66.self_attn.indexer.k_norm.bias",
      "model.layers.41.post_attention_layernorm",
      "model.layers.51.post_attention_layernorm",
      "model.layers.22.self_attn.indexer.k_norm.bias",
      "model.layers.21.mlp.gate.e_score_correction_bias",
      "model.layers.15.self_attn.kv_a_layernorm",
      "model.layers.25.self_attn.kv_a_layernorm",
      "model.layers.55.mlp.gate",
      "model.layers.11.self_attn.q_a_layernorm",
      "model.layers.72.mlp.gate",
      "model.layers.21.self_attn.kv_a_layernorm",
      "model.layers.59.mlp.gate.e_score_correction_bias",
      "model.layers.2.input_layernorm",
      "model.layers.5.mlp.gate",
      "model.layers.54.self_attn.kv_a_layernorm",
      "model.layers.0.self_attn.indexers_proj",
      "model.layers.71.mlp.gate.e_score_correction_bias",
      "model.layers.6.self_attn.q_a_layernorm",
      "model.layers.14.mlp.gate",
      "model.layers.44.self_attn.kv_a_layernorm",
      "model.layers.61.post_attention_layernorm",
      "model.layers.64.self_attn.kv_a_layernorm",
      "model.layers.1.post_attention_layernorm",
      "model.layers.4.mlp.gate",
      "model.layers.22.post_attention_layernorm",
      "model.layers.21.self_attn.q_a_layernorm",
      "model.layers.74.self_attn.q_a_layernorm",
      "model.layers.18.self_attn.indexers_proj",
      "model.layers.75.input_layernorm",
      "model.layers.70.self_attn.q_a_layernorm",
      "model.layers.22.self_attn.indexer.k_norm",
      "model.layers.42.mlp.gate.e_score_correction_bias",
      "model.layers.5.self_attn.kv_a_layernorm",
      "model.layers.31.mlp.gate.e_score_correction_bias",
      "model.layers.62.self_attn.indexer.k_norm.bias",
      "model.layers.29.post_attention_layernorm",
      "model.layers.6.self_attn.kv_a_layernorm",
      "model.layers.48.input_layernorm",
      "model.layers.74.self_attn.indexer.k_norm.bias",
      "model.layers.7.input_layernorm",
      "model.layers.39.self_attn.q_a_layernorm",
      "model.layers.41.input_layernorm",
      "model.layers.54.self_attn.indexer.k_norm",
      "model.layers.32.self_attn.q_a_layernorm",
      "model.layers.39.mlp.gate.e_score_correction_bias",
      "model.layers.42.input_layernorm",
      "model.layers.43.mlp.gate",
      "model.layers.72.self_attn.q_a_layernorm",
      "model.layers.37.mlp.gate.e_score_correction_bias",
      "model.layers.5.post_attention_layernorm",
      "model.layers.28.mlp.gate",
      "model.layers.2.post_attention_layernorm",
      "model.layers.49.post_attention_layernorm",
      "model.layers.43.self_attn.kv_a_layernorm",
      "model.layers.12.input_layernorm",
      "model.layers.56.mlp.gate",
      "model.layers.5.input_layernorm",
      "model.layers.29.mlp.gate.e_score_correction_bias",
      "model.layers.4.self_attn.kv_a_layernorm",
      "model.layers.20.self_attn.q_a_layernorm",
      "model.layers.59.self_attn.q_a_layernorm",
      "model.layers.68.mlp.gate",
      "model.layers.21.post_attention_layernorm",
      "model.layers.26.self_attn.q_a_layernorm",
      "model.layers.52.self_attn.q_a_layernorm",
      "model.layers.29.self_attn.kv_a_layernorm",
      "model.layers.24.input_layernorm",
      "model.layers.34.self_attn.indexer.k_norm.bias",
      "model.layers.43.input_layernorm",
      "model.layers.27.self_attn.kv_a_layernorm",
      "model.layers.31.input_layernorm",
      "model.layers.69.mlp.gate",
      "model.layers.26.post_attention_layernorm",
      "model.layers.3.self_attn.q_a_layernorm",
      "model.layers.37.post_attention_layernorm",
      "model.layers.52.mlp.gate",
      "model.layers.73.input_layernorm",
      "model.layers.19.input_layernorm",
      "model.layers.13.self_attn.q_a_layernorm",
      "model.layers.76.input_layernorm",
      "model.layers.8.mlp.gate",
      "model.layers.63.post_attention_layernorm",
      "model.layers.58.mlp.gate",
      "model.layers.31.post_attention_layernorm",
      "model.layers.23.mlp.gate.e_score_correction_bias",
      "model.layers.34.self_attn.q_a_layernorm",
      "model.layers.78.self_attn.indexer.k_norm.bias",
      "model.layers.13.mlp.gate.e_score_correction_bias",
      "model.layers.71.mlp.gate",
      "model.layers.14.input_layernorm",
      "model.layers.17.mlp.gate.e_score_correction_bias",
      "model.layers.8.post_attention_layernorm",
      "model.layers.45.self_attn.kv_a_layernorm",
      "model.layers.46.self_attn.indexer.k_norm",
      "model.layers.20.self_attn.kv_a_layernorm",
      "model.layers.78.self_attn.indexer.k_norm",
      "model.layers.37.mlp.gate",
      "model.layers.7.mlp.gate",
      "model.layers.30.mlp.gate.e_score_correction_bias",
      "model.layers.67.mlp.gate",
      "model.layers.73.self_attn.q_a_layernorm",
      "model.layers.10.self_attn.kv_a_layernorm",
      "model.layers.61.mlp.gate",
      "model.layers.22.mlp.gate.e_score_correction_bias",
      "model.layers.58.input_layernorm",
      "model.layers.8.self_attn.kv_a_layernorm",
      "model.layers.33.self_attn.q_a_layernorm",
      "model.layers.55.self_attn.q_a_layernorm",
      "model.layers.32.input_layernorm",
      "model.layers.17.self_attn.kv_a_layernorm",
      "model.layers.46.self_attn.indexer.k_norm.bias",
      "model.layers.11.mlp.gate.e_score_correction_bias",
      "model.layers.9.input_layernorm",
      "model.layers.77.input_layernorm",
      "model.layers.16.self_attn.kv_a_layernorm",
      "model.layers.45.post_attention_layernorm",
      "model.layers.74.mlp.gate",
      "model.layers.68.self_attn.q_a_layernorm",
      "model.layers.55.self_attn.kv_a_layernorm",
      "model.layers.44.input_layernorm",
      "model.layers.60.self_attn.kv_a_layernorm",
      "model.layers.14.post_attention_layernorm",
      "model.layers.62.self_attn.indexers_proj",
      "model.layers.0.self_attn.q_a_layernorm",
      "model.layers.72.post_attention_layernorm",
      "model.layers.78.post_attention_layernorm",
      "model.layers.60.mlp.gate.e_score_correction_bias",
      "model.layers.26.self_attn.indexer.k_norm.bias",
      "model.layers.38.post_attention_layernorm",
      "model.layers.50.post_attention_layernorm",
      "model.layers.28.input_layernorm",
      "model.layers.30.self_attn.indexer.k_norm",
      "model.layers.37.self_attn.q_a_layernorm",
      "model.layers.56.input_layernorm",
      "model.layers.27.post_attention_layernorm",
      "model.layers.74.input_layernorm",
      "model.layers.78.self_attn.q_a_layernorm",
      "model.layers.42.self_attn.q_a_layernorm",
      "model.layers.26.self_attn.indexer.k_norm",
      "model.layers.42.self_attn.kv_a_layernorm",
      "model.layers.1.self_attn.indexer.k_norm",
      "model.layers.39.post_attention_layernorm",
      "model.layers.48.mlp.gate.e_score_correction_bias",
      "model.layers.74.post_attention_layernorm",
      "model.layers.69.self_attn.q_a_layernorm",
      "model.layers.13.input_layernorm",
      "model.layers.74.self_attn.indexer.k_norm",
      "model.layers.29.mlp.gate",
      "model.layers.7.mlp.gate.e_score_correction_bias",
      "model.layers.3.self_attn.kv_a_layernorm",
      "model.layers.35.self_attn.kv_a_layernorm",
      "model.layers.46.self_attn.indexers_proj",
      "model.layers.0.self_attn.kv_a_layernorm",
      "model.layers.43.self_attn.q_a_layernorm",
      "model.norm",
      "model.layers.1.self_attn.kv_a_layernorm",
      "model.layers.38.self_attn.indexer.k_norm.bias",
      "model.layers.30.self_attn.q_a_layernorm",
      "model.layers.0.input_layernorm",
      "model.layers.47.input_layernorm",
      "model.layers.8.self_attn.q_a_layernorm",
      "model.layers.61.self_attn.q_a_layernorm",
      "model.layers.1.self_attn.indexer.k_norm.bias",
      "model.layers.62.mlp.gate.e_score_correction_bias",
      "model.layers.66.self_attn.q_a_layernorm",
      "model.layers.46.self_attn.kv_a_layernorm",
      "model.layers.66.mlp.gate",
      "model.layers.69.input_layernorm",
      "model.layers.69.self_attn.kv_a_layernorm",
      "model.layers.22.input_layernorm",
      "model.layers.30.post_attention_layernorm",
      "model.layers.24.self_attn.q_a_layernorm",
      "model.layers.48.mlp.gate",
      "model.layers.7.self_attn.kv_a_layernorm",
      "model.layers.67.input_layernorm",
      "model.layers.27.self_attn.q_a_layernorm",
      "model.layers.23.mlp.gate",
      "model.layers.45.mlp.gate.e_score_correction_bias",
      "model.layers.76.self_attn.kv_a_layernorm",
      "model.layers.22.self_attn.q_a_layernorm",
      "model.layers.78.mlp.gate",
      "model.layers.9.mlp.gate",
      "model.layers.57.self_attn.q_a_layernorm",
      "model.layers.78.mlp.gate.e_score_correction_bias",
      "model.layers.23.post_attention_layernorm",
      "model.layers.38.self_attn.q_a_layernorm",
      "model.layers.53.mlp.gate",
      "model.layers.77.self_attn.q_a_layernorm",
      "model.layers.62.self_attn.kv_a_layernorm",
      "model.layers.12.mlp.gate",
      "model.layers.34.self_attn.indexer.k_norm",
      "model.layers.46.self_attn.q_a_layernorm",
      "model.layers.36.self_attn.q_a_layernorm",
      "model.layers.58.self_attn.indexer.k_norm.bias",
      "model.layers.60.post_attention_layernorm",
      "model.layers.28.post_attention_layernorm",
      "model.layers.2.self_attn.kv_a_layernorm",
      "model.layers.70.self_attn.indexers_proj",
      "model.layers.16.mlp.gate.e_score_correction_bias",
      "model.layers.2.self_attn.indexer.k_norm",
      "model.layers.31.self_attn.kv_a_layernorm",
      "model.layers.64.input_layernorm",
      "model.layers.6.mlp.gate.e_score_correction_bias",
      "model.layers.50.self_attn.indexer.k_norm",
      "model.layers.58.self_attn.q_a_layernorm",
      "model.layers.57.mlp.gate.e_score_correction_bias",
      "model.layers.13.post_attention_layernorm",
      "model.layers.28.self_attn.kv_a_layernorm",
      "model.layers.31.self_attn.q_a_layernorm",
      "model.layers.1.self_attn.q_a_layernorm",
      "model.layers.17.mlp.gate",
      "model.layers.15.post_attention_layernorm",
      "model.layers.18.self_attn.indexer.k_norm.bias",
      "model.layers.18.self_attn.indexer.k_norm",
      "model.layers.43.mlp.gate.e_score_correction_bias",
      "model.layers.11.input_layernorm",
      "model.layers.9.post_attention_layernorm",
      "model.layers.33.input_layernorm",
      "model.layers.66.input_layernorm",
      "model.layers.78.self_attn.indexers_proj",
      "model.layers.54.post_attention_layernorm",
      "model.layers.53.mlp.gate.e_score_correction_bias",
      "model.layers.5.mlp.gate.e_score_correction_bias",
      "model.layers.19.mlp.gate",
      "model.layers.49.mlp.gate",
      "model.layers.66.self_attn.indexers_proj",
      "model.layers.14.self_attn.indexer.k_norm.bias",
      "model.layers.41.mlp.gate",
      "model.layers.42.self_attn.indexer.k_norm.bias",
      "model.layers.65.input_layernorm",
      "model.layers.75.mlp.gate",
      "model.layers.12.self_attn.kv_a_layernorm",
      "model.layers.53.input_layernorm",
      "model.layers.58.self_attn.kv_a_layernorm",
      "model.layers.60.self_attn.q_a_layernorm",
      "model.layers.6.mlp.gate",
      "model.layers.49.self_attn.kv_a_layernorm",
      "model.layers.16.mlp.gate",
      "model.layers.22.mlp.gate",
      "model.layers.58.post_attention_layernorm",
      "model.layers.15.mlp.gate.e_score_correction_bias",
      "model.layers.26.input_layernorm",
      "model.layers.3.post_attention_layernorm",
      "model.layers.6.input_layernorm",
      "model.layers.22.self_attn.kv_a_layernorm",
      "model.layers.16.input_layernorm",
      "model.layers.33.post_attention_layernorm",
      "model.layers.17.post_attention_layernorm",
      "model.layers.35.mlp.gate",
      "model.layers.56.post_attention_layernorm",
      "model.layers.7.self_attn.q_a_layernorm",
      "model.layers.24.mlp.gate",
      "model.layers.24.post_attention_layernorm",
      "model.layers.36.mlp.gate.e_score_correction_bias",
      "model.layers.56.mlp.gate.e_score_correction_bias",
      "model.layers.32.post_attention_layernorm",
      "model.layers.47.post_attention_layernorm",
      "model.layers.40.mlp.gate",
      "model.layers.41.self_attn.kv_a_layernorm",
      "model.layers.52.self_attn.kv_a_layernorm",
      "model.layers.9.self_attn.kv_a_layernorm",
      "model.layers.77.mlp.gate.e_score_correction_bias",
      "model.layers.78.shared_head.norm",
      "model.layers.53.post_attention_layernorm",
      "model.layers.63.self_attn.kv_a_layernorm",
      "model.layers.48.self_attn.kv_a_layernorm",
      "model.layers.28.mlp.gate.e_score_correction_bias",
      "model.layers.8.mlp.gate.e_score_correction_bias",
      "model.layers.52.mlp.gate.e_score_correction_bias",
      "model.layers.52.post_attention_layernorm",
      "model.layers.18.self_attn.q_a_layernorm",
      "model.layers.50.mlp.gate.e_score_correction_bias",
      "model.layers.64.mlp.gate.e_score_correction_bias",
      "model.layers.38.mlp.gate.e_score_correction_bias",
      "model.layers.59.input_layernorm",
      "model.layers.21.input_layernorm",
      "model.layers.39.mlp.gate",
      "model.layers.77.post_attention_layernorm",
      "model.layers.76.self_attn.q_a_layernorm",
      "model.layers.12.post_attention_layernorm",
      "model.layers.43.post_attention_layernorm",
      "model.layers.35.input_layernorm",
      "model.layers.62.mlp.gate",
      "model.layers.38.self_attn.kv_a_layernorm",
      "model.layers.63.mlp.gate",
      "model.layers.27.mlp.gate.e_score_correction_bias",
      "model.layers.18.mlp.gate",
      "model.layers.25.post_attention_layernorm",
      "model.layers.55.mlp.gate.e_score_correction_bias",
      "model.layers.66.self_attn.indexer.k_norm",
      "model.layers.48.self_attn.q_a_layernorm",
      "model.layers.78.eh_proj",
      "model.layers.77.mlp.gate",
      "model.layers.6.self_attn.indexers_proj",
      "model.layers.14.self_attn.q_a_layernorm",
      "model.layers.2.self_attn.q_a_layernorm",
      "model.layers.42.mlp.gate",
      "model.layers.54.mlp.gate.e_score_correction_bias",
      "model.layers.60.input_layernorm",
      "model.layers.40.self_attn.kv_a_layernorm",
      "model.layers.51.self_attn.kv_a_layernorm",
      "model.layers.18.input_layernorm",
      "model.layers.30.self_attn.indexers_proj",
      "model.layers.53.self_attn.kv_a_layernorm",
      "model.layers.6.post_attention_layernorm",
      "model.layers.70.self_attn.indexer.k_norm.bias",
      "model.layers.54.input_layernorm",
      "model.layers.41.self_attn.q_a_layernorm",
      "model.layers.18.mlp.gate.e_score_correction_bias",
      "model.layers.34.mlp.gate.e_score_correction_bias",
      "model.layers.47.mlp.gate",
      "model.layers.46.mlp.gate",
      "model.layers.25.self_attn.q_a_layernorm",
      "model.layers.63.mlp.gate.e_score_correction_bias",
      "model.layers.66.post_attention_layernorm",
      "model.layers.76.mlp.gate",
      "model.embed_tokens",
      "model.layers.67.self_attn.kv_a_layernorm",
      "model.layers.67.mlp.gate.e_score_correction_bias",
      "model.layers.26.self_attn.kv_a_layernorm",
      "model.layers.31.mlp.gate",
      "model.layers.18.self_attn.kv_a_layernorm",
      "model.layers.34.mlp.gate",
      "model.layers.55.post_attention_layernorm",
      "model.layers.30.input_layernorm",
      "model.layers.50.mlp.gate",
      "model.layers.63.input_layernorm",
      "model.layers.11.self_attn.kv_a_layernorm",
      "model.layers.24.self_attn.kv_a_layernorm",
      "model.layers.75.mlp.gate.e_score_correction_bias",
      "model.layers.10.post_attention_layernorm",
      "model.layers.1.self_attn.indexers_proj",
      "model.layers.42.self_attn.indexers_proj",
      "model.layers.46.input_layernorm",
      "model.layers.23.self_attn.q_a_layernorm",
      "model.layers.63.self_attn.q_a_layernorm",
      "model.layers.14.self_attn.indexer.k_norm",
      "model.layers.14.self_attn.indexers_proj",
      "model.layers.60.mlp.gate",
      "model.layers.70.mlp.gate.e_score_correction_bias",
      "model.layers.53.self_attn.q_a_layernorm",
      "model.layers.0.post_attention_layernorm",
      "model.layers.35.mlp.gate.e_score_correction_bias",
      "model.layers.75.self_attn.kv_a_layernorm",
      "model.layers.1.input_layernorm",
      "model.layers.42.post_attention_layernorm",
      "model.layers.37.input_layernorm",
      "model.layers.9.mlp.gate.e_score_correction_bias",
      "model.layers.46.post_attention_layernorm",
      "model.layers.26.mlp.gate",
      "model.layers.65.mlp.gate.e_score_correction_bias",
      "model.layers.67.self_attn.q_a_layernorm",
      "model.layers.44.mlp.gate.e_score_correction_bias",
      "model.layers.33.mlp.gate",
      "model.layers.29.input_layernorm",
      "model.layers.18.post_attention_layernorm",
      "model.layers.75.post_attention_layernorm",
      "model.layers.44.self_attn.q_a_layernorm",
      "model.layers.10.mlp.gate",
      "model.layers.21.mlp.gate",
      "model.layers.58.mlp.gate.e_score_correction_bias",
      "model.layers.7.post_attention_layernorm",
      "model.layers.50.self_attn.q_a_layernorm",
      "model.layers.9.self_attn.q_a_layernorm",
      "model.layers.2.self_attn.indexers_proj",
      "model.layers.0.self_attn.indexer.k_norm.bias",
      "model.layers.74.self_attn.kv_a_layernorm",
      "model.layers.74.mlp.gate.e_score_correction_bias",
      "model.layers.49.mlp.gate.e_score_correction_bias",
      "model.layers.62.post_attention_layernorm",
      "model.layers.57.self_attn.kv_a_layernorm",
      "model.layers.40.input_layernorm",
      "model.layers.69.mlp.gate.e_score_correction_bias",
      "model.layers.35.post_attention_layernorm",
      "model.layers.74.self_attn.indexers_proj",
      "model.layers.55.input_layernorm",
      "model.layers.49.input_layernorm",
      "model.layers.40.mlp.gate.e_score_correction_bias",
      "model.layers.25.mlp.gate",
      "model.layers.2.self_attn.indexer.k_norm.bias",
      "model.layers.68.self_attn.kv_a_layernorm",
      "model.layers.51.input_layernorm",
      "model.layers.22.self_attn.indexers_proj",
      "model.layers.10.input_layernorm",
      "model.layers.42.self_attn.indexer.k_norm",
      "model.layers.56.self_attn.kv_a_layernorm",
      "model.layers.17.self_attn.q_a_layernorm",
      "model.layers.59.self_attn.kv_a_layernorm",
      "model.layers.3.input_layernorm",
      "model.layers.57.input_layernorm",
      "model.layers.38.input_layernorm",
      "model.layers.62.self_attn.indexer.k_norm",
      "model.layers.20.mlp.gate",
      "model.layers.64.mlp.gate",
      "model.layers.28.self_attn.q_a_layernorm",
      "model.layers.32.self_attn.kv_a_layernorm",
      "model.layers.10.mlp.gate.e_score_correction_bias",
      "model.layers.5.self_attn.q_a_layernorm",
      "model.layers.37.self_attn.kv_a_layernorm"
    ]
  }
}
