{
    "metadata": {
        "total_size": 869157697024
    },
    "weight_map": {
        "language_model.lm_head.weight": "model-00001-of-00059.safetensors",
        "language_model.model.embed_tokens.weight": "model-00001-of-00059.safetensors",
        "language_model.model.norm.weight": "model-00001-of-00059.safetensors",
        "language_model.model.layers.0.input_layernorm.weight": "model-00001-of-00059.safetensors",
        "language_model.model.layers.0.mlp.down_proj.weight": "model-00001-of-00059.safetensors",
        "language_model.model.layers.0.mlp.gate_proj.weight": "model-00001-of-00059.safetensors",
        "language_model.model.layers.0.mlp.up_proj.weight": "model-00001-of-00059.safetensors",
        "language_model.model.layers.0.post_attention_layernorm.weight": "model-00001-of-00059.safetensors",
        "language_model.model.layers.0.self_attn.k_norm.weight": "model-00001-of-00059.safetensors",
        "language_model.model.layers.0.self_attn.k_proj.weight": "model-00001-of-00059.safetensors",
        "language_model.model.layers.0.self_attn.o_proj.weight": "model-00001-of-00059.safetensors",
        "language_model.model.layers.0.self_attn.q_norm.weight": "model-00001-of-00059.safetensors",
        "language_model.model.layers.0.self_attn.q_proj.weight": "model-00001-of-00059.safetensors",
        "language_model.model.layers.0.self_attn.v_proj.weight": "model-00001-of-00059.safetensors",
        "language_model.model.layers.1.input_layernorm.weight": "model-00002-of-00059.safetensors",
        "language_model.model.layers.1.mlp.down_proj.weight": "model-00002-of-00059.safetensors",
        "language_model.model.layers.1.mlp.gate_proj.weight": "model-00002-of-00059.safetensors",
        "language_model.model.layers.1.mlp.up_proj.weight": "model-00002-of-00059.safetensors",
        "language_model.model.layers.1.post_attention_layernorm.weight": "model-00002-of-00059.safetensors",
        "language_model.model.layers.1.self_attn.k_norm.weight": "model-00002-of-00059.safetensors",
        "language_model.model.layers.1.self_attn.k_proj.weight": "model-00002-of-00059.safetensors",
        "language_model.model.layers.1.self_attn.o_proj.weight": "model-00002-of-00059.safetensors",
        "language_model.model.layers.1.self_attn.q_norm.weight": "model-00002-of-00059.safetensors",
        "language_model.model.layers.1.self_attn.q_proj.weight": "model-00002-of-00059.safetensors",
        "language_model.model.layers.1.self_attn.v_proj.weight": "model-00002-of-00059.safetensors",
        "language_model.model.layers.2.input_layernorm.weight": "model-00002-of-00059.safetensors",
        "language_model.model.layers.2.mlp.down_proj.weight": "model-00002-of-00059.safetensors",
        "language_model.model.layers.2.mlp.gate_proj.weight": "model-00002-of-00059.safetensors",
        "language_model.model.layers.2.mlp.up_proj.weight": "model-00002-of-00059.safetensors",
        "language_model.model.layers.2.post_attention_layernorm.weight": "model-00002-of-00059.safetensors",
        "language_model.model.layers.2.self_attn.k_norm.weight": "model-00002-of-00059.safetensors",
        "language_model.model.layers.2.self_attn.k_proj.weight": "model-00002-of-00059.safetensors",
        "language_model.model.layers.2.self_attn.o_proj.weight": "model-00002-of-00059.safetensors",
        "language_model.model.layers.2.self_attn.q_norm.weight": "model-00002-of-00059.safetensors",
        "language_model.model.layers.2.self_attn.q_proj.weight": "model-00002-of-00059.safetensors",
        "language_model.model.layers.2.self_attn.v_proj.weight": "model-00002-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.e_score_correction_bias": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.0.w1.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.0.w2.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.0.w3.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.1.w1.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.1.w2.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.1.w3.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.10.w1.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.10.w2.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.10.w3.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.100.w1.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.100.w2.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.100.w3.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.101.w1.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.101.w2.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.101.w3.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.102.w1.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.102.w2.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.102.w3.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.103.w1.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.103.w2.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.103.w3.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.104.w1.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.104.w2.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.104.w3.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.105.w1.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.105.w2.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.105.w3.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.106.w1.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.106.w2.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.106.w3.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.107.w1.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.107.w2.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.107.w3.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.108.w1.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.108.w2.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.108.w3.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.109.w1.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.109.w2.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.109.w3.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.11.w1.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.11.w2.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.11.w3.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.110.w1.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.110.w2.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.110.w3.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.111.w1.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.111.w2.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.111.w3.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.112.w1.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.112.w2.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.112.w3.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.113.w1.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.113.w2.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.113.w3.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.114.w1.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.114.w2.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.114.w3.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.115.w1.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.115.w2.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.115.w3.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.116.w1.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.116.w2.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.116.w3.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.117.w1.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.117.w2.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.117.w3.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.118.w1.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.118.w2.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.118.w3.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.119.w1.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.119.w2.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.119.w3.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.12.w1.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.12.w2.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.12.w3.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.120.w1.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.120.w2.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.120.w3.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.121.w1.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.121.w2.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.121.w3.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.122.w1.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.122.w2.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.122.w3.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.123.w1.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.123.w2.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.123.w3.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.124.w1.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.124.w2.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.124.w3.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.125.w1.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.125.w2.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.125.w3.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.126.w1.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.126.w2.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.126.w3.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.127.w1.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.127.w2.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.127.w3.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.13.w1.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.13.w2.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.13.w3.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.14.w1.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.14.w2.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.14.w3.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.15.w1.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.15.w2.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.15.w3.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.16.w1.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.16.w2.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.16.w3.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.17.w1.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.17.w2.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.17.w3.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.18.w1.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.18.w2.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.18.w3.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.19.w1.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.19.w2.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.19.w3.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.2.w1.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.2.w2.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.2.w3.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.20.w1.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.20.w2.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.20.w3.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.21.w1.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.21.w2.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.21.w3.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.22.w1.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.22.w2.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.22.w3.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.23.w1.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.23.w2.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.23.w3.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.24.w1.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.24.w2.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.24.w3.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.25.w1.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.25.w2.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.25.w3.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.26.w1.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.26.w2.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.26.w3.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.27.w1.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.27.w2.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.27.w3.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.28.w1.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.28.w2.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.28.w3.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.29.w1.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.29.w2.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.29.w3.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.3.w1.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.3.w2.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.3.w3.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.30.w1.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.30.w2.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.30.w3.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.31.w1.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.31.w2.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.31.w3.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.32.w1.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.32.w2.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.32.w3.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.33.w1.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.33.w2.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.33.w3.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.34.w1.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.34.w2.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.34.w3.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.35.w1.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.35.w2.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.35.w3.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.36.w1.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.36.w2.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.36.w3.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.37.w1.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.37.w2.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.37.w3.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.38.w1.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.38.w2.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.38.w3.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.39.w1.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.39.w2.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.39.w3.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.4.w1.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.4.w2.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.4.w3.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.40.w1.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.40.w2.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.40.w3.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.41.w1.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.41.w2.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.41.w3.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.42.w1.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.42.w2.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.42.w3.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.43.w1.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.43.w2.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.43.w3.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.44.w1.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.44.w2.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.44.w3.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.45.w1.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.45.w2.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.45.w3.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.46.w1.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.46.w2.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.46.w3.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.47.w1.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.47.w2.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.47.w3.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.48.w1.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.48.w2.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.48.w3.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.49.w1.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.49.w2.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.49.w3.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.5.w1.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.5.w2.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.5.w3.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.50.w1.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.50.w2.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.50.w3.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.51.w1.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.51.w2.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.51.w3.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.52.w1.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.52.w2.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.52.w3.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.53.w1.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.53.w2.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.53.w3.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.54.w1.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.54.w2.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.54.w3.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.55.w1.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.55.w2.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.55.w3.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.56.w1.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.56.w2.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.56.w3.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.57.w1.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.57.w2.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.57.w3.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.58.w1.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.58.w2.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.58.w3.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.59.w1.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.59.w2.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.59.w3.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.6.w1.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.6.w2.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.6.w3.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.60.w1.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.60.w2.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.60.w3.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.61.w1.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.61.w2.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.61.w3.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.62.w1.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.62.w2.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.62.w3.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.63.w1.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.63.w2.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.63.w3.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.64.w1.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.64.w2.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.64.w3.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.65.w1.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.65.w2.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.65.w3.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.66.w1.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.66.w2.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.66.w3.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.67.w1.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.67.w2.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.67.w3.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.68.w1.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.68.w2.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.68.w3.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.69.w1.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.69.w2.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.69.w3.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.7.w1.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.7.w2.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.7.w3.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.70.w1.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.70.w2.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.70.w3.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.71.w1.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.71.w2.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.71.w3.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.72.w1.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.72.w2.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.72.w3.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.73.w1.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.73.w2.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.73.w3.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.74.w1.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.74.w2.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.74.w3.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.75.w1.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.75.w2.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.75.w3.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.76.w1.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.76.w2.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.76.w3.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.77.w1.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.77.w2.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.77.w3.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.78.w1.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.78.w2.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.78.w3.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.79.w1.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.79.w2.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.79.w3.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.8.w1.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.8.w2.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.8.w3.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.80.w1.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.80.w2.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.80.w3.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.81.w1.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.81.w2.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.81.w3.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.82.w1.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.82.w2.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.82.w3.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.83.w1.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.83.w2.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.83.w3.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.84.w1.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.84.w2.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.84.w3.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.85.w1.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.85.w2.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.85.w3.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.86.w1.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.86.w2.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.86.w3.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.87.w1.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.87.w2.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.87.w3.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.88.w1.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.88.w2.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.88.w3.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.89.w1.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.89.w2.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.89.w3.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.9.w1.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.9.w2.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.9.w3.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.90.w1.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.90.w2.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.90.w3.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.91.w1.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.91.w2.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.91.w3.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.92.w1.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.92.w2.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.92.w3.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.93.w1.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.93.w2.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.93.w3.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.94.w1.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.94.w2.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.94.w3.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.95.w1.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.95.w2.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.95.w3.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.96.w1.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.96.w2.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.96.w3.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.97.w1.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.97.w2.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.97.w3.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.98.w1.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.98.w2.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.98.w3.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.99.w1.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.99.w2.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.experts.99.w3.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.gate.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.shared_experts.down_proj.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.shared_experts.gate_proj.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.block_sparse_moe.shared_experts.up_proj.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.input_layernorm.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.post_attention_layernorm.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.self_attn.index_k_norm.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.self_attn.index_k_proj.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.self_attn.index_q_norm.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.self_attn.index_q_proj.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.self_attn.k_norm.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.self_attn.k_proj.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.self_attn.o_proj.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.self_attn.q_norm.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.self_attn.q_proj.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.3.self_attn.v_proj.weight": "model-00003-of-00059.safetensors",
        "language_model.model.layers.4.block_sparse_moe.e_score_correction_bias": "model-00004-of-00059.safetensors",
        "language_model.model.layers.4.block_sparse_moe.experts.0.w1.weight": "model-00004-of-00059.safetensors",
